espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/interrupt_core0_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** INTERRUPT_CORE0_LP_RTC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_RTC_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x0)
/** INTERRUPT_CORE0_LP_RTC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_RTC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_RTC_INT_MAP_M  (CORE0_LP_RTC_INT_MAP_V << CORE0_LP_RTC_INT_MAP_S)
#define INTERRUPT_CORE0_LP_RTC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_RTC_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_WDT_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_WDT_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x4)
/** INTERRUPT_CORE0_LP_WDT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_WDT_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_WDT_INT_MAP_M  (CORE0_LP_WDT_INT_MAP_V << CORE0_LP_WDT_INT_MAP_S)
#define INTERRUPT_CORE0_LP_WDT_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_WDT_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x8)
/** INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP_M  (CORE0_LP_TIMER_REG_0_INT_MAP_V << CORE0_LP_TIMER_REG_0_INT_MAP_S)
#define INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xc)
/** INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP_M  (CORE0_LP_TIMER_REG_1_INT_MAP_V << CORE0_LP_TIMER_REG_1_INT_MAP_S)
#define INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP_S  0

/** INTERRUPT_CORE0_MB_HP_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_MB_HP_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x10)
/** INTERRUPT_CORE0_MB_HP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_MB_HP_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_MB_HP_INT_MAP_M  (CORE0_MB_HP_INT_MAP_V << CORE0_MB_HP_INT_MAP_S)
#define INTERRUPT_CORE0_MB_HP_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MB_HP_INT_MAP_S  0

/** INTERRUPT_CORE0_MB_LP_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_MB_LP_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x14)
/** INTERRUPT_CORE0_MB_LP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_MB_LP_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_MB_LP_INT_MAP_M  (CORE0_MB_LP_INT_MAP_V << CORE0_MB_LP_INT_MAP_S)
#define INTERRUPT_CORE0_MB_LP_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MB_LP_INT_MAP_S  0

/** INTERRUPT_CORE0_PMU_REG_0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_PMU_REG_0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x18)
/** INTERRUPT_CORE0_PMU_REG_0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_PMU_REG_0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_PMU_REG_0_INT_MAP_M  (CORE0_PMU_REG_0_INT_MAP_V << CORE0_PMU_REG_0_INT_MAP_S)
#define INTERRUPT_CORE0_PMU_REG_0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PMU_REG_0_INT_MAP_S  0

/** INTERRUPT_CORE0_PMU_REG_1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_PMU_REG_1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1c)
/** INTERRUPT_CORE0_PMU_REG_1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_PMU_REG_1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_PMU_REG_1_INT_MAP_M  (CORE0_PMU_REG_1_INT_MAP_V << CORE0_PMU_REG_1_INT_MAP_S)
#define INTERRUPT_CORE0_PMU_REG_1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PMU_REG_1_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_ANAPERI_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_ANAPERI_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x20)
/** INTERRUPT_CORE0_LP_ANAPERI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_ANAPERI_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_ANAPERI_INT_MAP_M  (CORE0_LP_ANAPERI_INT_MAP_V << CORE0_LP_ANAPERI_INT_MAP_S)
#define INTERRUPT_CORE0_LP_ANAPERI_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_ANAPERI_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_ADC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_ADC_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x24)
/** INTERRUPT_CORE0_LP_ADC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_ADC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_ADC_INT_MAP_M  (CORE0_LP_ADC_INT_MAP_V << CORE0_LP_ADC_INT_MAP_S)
#define INTERRUPT_CORE0_LP_ADC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_ADC_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_GPIO_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_GPIO_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x28)
/** INTERRUPT_CORE0_LP_GPIO_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_GPIO_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_GPIO_INT_MAP_M  (CORE0_LP_GPIO_INT_MAP_V << CORE0_LP_GPIO_INT_MAP_S)
#define INTERRUPT_CORE0_LP_GPIO_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_GPIO_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_I2C_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_I2C_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2c)
/** INTERRUPT_CORE0_LP_I2C_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_I2C_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_I2C_INT_MAP_M  (CORE0_LP_I2C_INT_MAP_V << CORE0_LP_I2C_INT_MAP_S)
#define INTERRUPT_CORE0_LP_I2C_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_I2C_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_I2S_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_I2S_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x30)
/** INTERRUPT_CORE0_LP_I2S_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_I2S_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_I2S_INT_MAP_M  (CORE0_LP_I2S_INT_MAP_V << CORE0_LP_I2S_INT_MAP_S)
#define INTERRUPT_CORE0_LP_I2S_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_I2S_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_SPI_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_SPI_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x34)
/** INTERRUPT_CORE0_LP_SPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_SPI_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_SPI_INT_MAP_M  (CORE0_LP_SPI_INT_MAP_V << CORE0_LP_SPI_INT_MAP_S)
#define INTERRUPT_CORE0_LP_SPI_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_SPI_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_TOUCH_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_TOUCH_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x38)
/** INTERRUPT_CORE0_LP_TOUCH_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_TOUCH_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_TOUCH_INT_MAP_M  (CORE0_LP_TOUCH_INT_MAP_V << CORE0_LP_TOUCH_INT_MAP_S)
#define INTERRUPT_CORE0_LP_TOUCH_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_TOUCH_INT_MAP_S  0

