espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_LP_TSENS_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_TSENS_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x3c)
/** INTERRUPT_CORE0_LP_TSENS_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_TSENS_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_TSENS_INT_MAP_M  (CORE0_LP_TSENS_INT_MAP_V << CORE0_LP_TSENS_INT_MAP_S)
#define INTERRUPT_CORE0_LP_TSENS_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_TSENS_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_UART_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_UART_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x40)
/** INTERRUPT_CORE0_LP_UART_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_UART_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_UART_INT_MAP_M  (CORE0_LP_UART_INT_MAP_V << CORE0_LP_UART_INT_MAP_S)
#define INTERRUPT_CORE0_LP_UART_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_UART_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_EFUSE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_EFUSE_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x44)
/** INTERRUPT_CORE0_LP_EFUSE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_EFUSE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_EFUSE_INT_MAP_M  (CORE0_LP_EFUSE_INT_MAP_V << CORE0_LP_EFUSE_INT_MAP_S)
#define INTERRUPT_CORE0_LP_EFUSE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_EFUSE_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_SW_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_SW_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x48)
/** INTERRUPT_CORE0_LP_SW_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_SW_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_SW_INT_MAP_M  (CORE0_LP_SW_INT_MAP_V << CORE0_LP_SW_INT_MAP_S)
#define INTERRUPT_CORE0_LP_SW_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_SW_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_SYSREG_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_SYSREG_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x4c)
/** INTERRUPT_CORE0_LP_SYSREG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_SYSREG_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_SYSREG_INT_MAP_M  (CORE0_LP_SYSREG_INT_MAP_V << CORE0_LP_SYSREG_INT_MAP_S)
#define INTERRUPT_CORE0_LP_SYSREG_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_SYSREG_INT_MAP_S  0

/** INTERRUPT_CORE0_LP_HUK_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LP_HUK_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x50)
/** INTERRUPT_CORE0_LP_HUK_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LP_HUK_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_HUK_INT_MAP_M  (CORE0_LP_HUK_INT_MAP_V << CORE0_LP_HUK_INT_MAP_S)
#define INTERRUPT_CORE0_LP_HUK_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_HUK_INT_MAP_S  0

/** INTERRUPT_CORE0_SYS_ICM_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_SYS_ICM_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x54)
/** INTERRUPT_CORE0_SYS_ICM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_SYS_ICM_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_SYS_ICM_INT_MAP_M  (CORE0_SYS_ICM_INT_MAP_V << CORE0_SYS_ICM_INT_MAP_S)
#define INTERRUPT_CORE0_SYS_ICM_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SYS_ICM_INT_MAP_S  0

/** INTERRUPT_CORE0_USB_DEVICE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_USB_DEVICE_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x58)
/** INTERRUPT_CORE0_USB_DEVICE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_USB_DEVICE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_USB_DEVICE_INT_MAP_M  (CORE0_USB_DEVICE_INT_MAP_V << CORE0_USB_DEVICE_INT_MAP_S)
#define INTERRUPT_CORE0_USB_DEVICE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_USB_DEVICE_INT_MAP_S  0

/** INTERRUPT_CORE0_SDIO_HOST_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_SDIO_HOST_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x5c)
/** INTERRUPT_CORE0_SDIO_HOST_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_SDIO_HOST_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_SDIO_HOST_INT_MAP_M  (CORE0_SDIO_HOST_INT_MAP_V << CORE0_SDIO_HOST_INT_MAP_S)
#define INTERRUPT_CORE0_SDIO_HOST_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SDIO_HOST_INT_MAP_S  0

/** INTERRUPT_CORE0_GDMA_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_GDMA_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x60)
/** INTERRUPT_CORE0_GDMA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_GDMA_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_GDMA_INT_MAP_M  (CORE0_GDMA_INT_MAP_V << CORE0_GDMA_INT_MAP_S)
#define INTERRUPT_CORE0_GDMA_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GDMA_INT_MAP_S  0

/** INTERRUPT_CORE0_SPI2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_SPI2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x64)
/** INTERRUPT_CORE0_SPI2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_SPI2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_SPI2_INT_MAP_M  (CORE0_SPI2_INT_MAP_V << CORE0_SPI2_INT_MAP_S)
#define INTERRUPT_CORE0_SPI2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SPI2_INT_MAP_S  0

/** INTERRUPT_CORE0_SPI3_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_SPI3_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x68)
/** INTERRUPT_CORE0_SPI3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_SPI3_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_SPI3_INT_MAP_M  (CORE0_SPI3_INT_MAP_V << CORE0_SPI3_INT_MAP_S)
#define INTERRUPT_CORE0_SPI3_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SPI3_INT_MAP_S  0

/** INTERRUPT_CORE0_I2S0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_I2S0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x6c)
/** INTERRUPT_CORE0_I2S0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_I2S0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2S0_INT_MAP_M  (CORE0_I2S0_INT_MAP_V << CORE0_I2S0_INT_MAP_S)
#define INTERRUPT_CORE0_I2S0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2S0_INT_MAP_S  0

/** INTERRUPT_CORE0_I2S1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_I2S1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x70)
/** INTERRUPT_CORE0_I2S1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_I2S1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2S1_INT_MAP_M  (CORE0_I2S1_INT_MAP_V << CORE0_I2S1_INT_MAP_S)
#define INTERRUPT_CORE0_I2S1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2S1_INT_MAP_S  0

/** INTERRUPT_CORE0_I2S2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_I2S2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x74)
/** INTERRUPT_CORE0_I2S2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_I2S2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2S2_INT_MAP_M  (CORE0_I2S2_INT_MAP_V << CORE0_I2S2_INT_MAP_S)
#define INTERRUPT_CORE0_I2S2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2S2_INT_MAP_S  0

/** INTERRUPT_CORE0_UHCI0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_UHCI0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x78)
/** INTERRUPT_CORE0_UHCI0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_UHCI0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_UHCI0_INT_MAP_M  (CORE0_UHCI0_INT_MAP_V << CORE0_UHCI0_INT_MAP_S)
#define INTERRUPT_CORE0_UHCI0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UHCI0_INT_MAP_S  0

/** INTERRUPT_CORE0_UART0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_UART0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x7c)
/** INTERRUPT_CORE0_UART0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_UART0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART0_INT_MAP_M  (CORE0_UART0_INT_MAP_V << CORE0_UART0_INT_MAP_S)
#define INTERRUPT_CORE0_UART0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART0_INT_MAP_S  0

/** INTERRUPT_CORE0_UART1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_UART1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x80)
/** INTERRUPT_CORE0_UART1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_UART1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART1_INT_MAP_M  (CORE0_UART1_INT_MAP_V << CORE0_UART1_INT_MAP_S)
#define INTERRUPT_CORE0_UART1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART1_INT_MAP_S  0

/** INTERRUPT_CORE0_UART2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_UART2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x84)
/** INTERRUPT_CORE0_UART2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_UART2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART2_INT_MAP_M  (CORE0_UART2_INT_MAP_V << CORE0_UART2_INT_MAP_S)
#define INTERRUPT_CORE0_UART2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART2_INT_MAP_S  0

/** INTERRUPT_CORE0_UART3_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_UART3_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x88)
/** INTERRUPT_CORE0_UART3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_UART3_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART3_INT_MAP_M  (CORE0_UART3_INT_MAP_V << CORE0_UART3_INT_MAP_S)
#define INTERRUPT_CORE0_UART3_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART3_INT_MAP_S  0

/** INTERRUPT_CORE0_UART4_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_UART4_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x8c)
/** INTERRUPT_CORE0_UART4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_UART4_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART4_INT_MAP_M  (CORE0_UART4_INT_MAP_V << CORE0_UART4_INT_MAP_S)
#define INTERRUPT_CORE0_UART4_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART4_INT_MAP_S  0

/** INTERRUPT_CORE0_LCD_CAM_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x90)
/** INTERRUPT_CORE0_LCD_CAM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_M  (CORE0_LCD_CAM_INT_MAP_V << CORE0_LCD_CAM_INT_MAP_S)
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_S  0

/** INTERRUPT_CORE0_ADC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_ADC_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x94)
/** INTERRUPT_CORE0_ADC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_ADC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_ADC_INT_MAP_M  (CORE0_ADC_INT_MAP_V << CORE0_ADC_INT_MAP_S)
#define INTERRUPT_CORE0_ADC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ADC_INT_MAP_S  0

/** INTERRUPT_CORE0_PWM0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_PWM0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x98)
/** INTERRUPT_CORE0_PWM0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_PWM0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_PWM0_INT_MAP_M  (CORE0_PWM0_INT_MAP_V << CORE0_PWM0_INT_MAP_S)
#define INTERRUPT_CORE0_PWM0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PWM0_INT_MAP_S  0

/** INTERRUPT_CORE0_PWM1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_PWM1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x9c)
/** INTERRUPT_CORE0_PWM1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_PWM1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_PWM1_INT_MAP_M  (CORE0_PWM1_INT_MAP_V << CORE0_PWM1_INT_MAP_S)
#define INTERRUPT_CORE0_PWM1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PWM1_INT_MAP_S  0

/** INTERRUPT_CORE0_CAN0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CAN0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xa0)
/** INTERRUPT_CORE0_CAN0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CAN0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_CAN0_INT_MAP_M  (CORE0_CAN0_INT_MAP_V << CORE0_CAN0_INT_MAP_S)
#define INTERRUPT_CORE0_CAN0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CAN0_INT_MAP_S  0

/** INTERRUPT_CORE0_CAN1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CAN1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xa4)
/** INTERRUPT_CORE0_CAN1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CAN1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_CAN1_INT_MAP_M  (CORE0_CAN1_INT_MAP_V << CORE0_CAN1_INT_MAP_S)
#define INTERRUPT_CORE0_CAN1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CAN1_INT_MAP_S  0

/** INTERRUPT_CORE0_CAN2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CAN2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xa8)
/** INTERRUPT_CORE0_CAN2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CAN2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_CAN2_INT_MAP_M  (CORE0_CAN2_INT_MAP_V << CORE0_CAN2_INT_MAP_S)
#define INTERRUPT_CORE0_CAN2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CAN2_INT_MAP_S  0

/** INTERRUPT_CORE0_RMT_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_RMT_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xac)
/** INTERRUPT_CORE0_RMT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_RMT_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_RMT_INT_MAP_M  (CORE0_RMT_INT_MAP_V << CORE0_RMT_INT_MAP_S)
#define INTERRUPT_CORE0_RMT_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_RMT_INT_MAP_S  0

/** INTERRUPT_CORE0_I2C0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_I2C0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xb0)
/** INTERRUPT_CORE0_I2C0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_I2C0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2C0_INT_MAP_M  (CORE0_I2C0_INT_MAP_V << CORE0_I2C0_INT_MAP_S)
#define INTERRUPT_CORE0_I2C0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2C0_INT_MAP_S  0

/** INTERRUPT_CORE0_I2C1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_I2C1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xb4)
/** INTERRUPT_CORE0_I2C1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_I2C1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2C1_INT_MAP_M  (CORE0_I2C1_INT_MAP_V << CORE0_I2C1_INT_MAP_S)
#define INTERRUPT_CORE0_I2C1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2C1_INT_MAP_S  0

/** INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xb8)
/** INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP_M  (CORE0_TIMERGRP0_T0_INT_MAP_V << CORE0_TIMERGRP0_T0_INT_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP_S  0

/** INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xbc)
/** INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP_M  (CORE0_TIMERGRP0_T1_INT_MAP_V << CORE0_TIMERGRP0_T1_INT_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP_S  0

