espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xc0)
/** INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP_M  (CORE0_TIMERGRP0_WDT_INT_MAP_V << CORE0_TIMERGRP0_WDT_INT_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP_S  0

/** INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xc4)
/** INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP_M  (CORE0_TIMERGRP1_T0_INT_MAP_V << CORE0_TIMERGRP1_T0_INT_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP_S  0

/** INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xc8)
/** INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP_M  (CORE0_TIMERGRP1_T1_INT_MAP_V << CORE0_TIMERGRP1_T1_INT_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP_S  0

/** INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xcc)
/** INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP_M  (CORE0_TIMERGRP1_WDT_INT_MAP_V << CORE0_TIMERGRP1_WDT_INT_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP_S  0

/** INTERRUPT_CORE0_LEDC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LEDC_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xd0)
/** INTERRUPT_CORE0_LEDC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LEDC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LEDC_INT_MAP_M  (CORE0_LEDC_INT_MAP_V << CORE0_LEDC_INT_MAP_S)
#define INTERRUPT_CORE0_LEDC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LEDC_INT_MAP_S  0

/** INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xd4)
/** INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_M  (CORE0_SYSTIMER_TARGET0_INT_MAP_V << CORE0_SYSTIMER_TARGET0_INT_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_S  0

/** INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xd8)
/** INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_M  (CORE0_SYSTIMER_TARGET1_INT_MAP_V << CORE0_SYSTIMER_TARGET1_INT_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_S  0

/** INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xdc)
/** INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_M  (CORE0_SYSTIMER_TARGET2_INT_MAP_V << CORE0_SYSTIMER_TARGET2_INT_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_S  0

/** INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xe0)
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP_M  (CORE0_AHB_PDMA_IN_CH0_INT_MAP_V << CORE0_AHB_PDMA_IN_CH0_INT_MAP_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP_S  0

/** INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xe4)
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP_M  (CORE0_AHB_PDMA_IN_CH1_INT_MAP_V << CORE0_AHB_PDMA_IN_CH1_INT_MAP_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP_S  0

/** INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xe8)
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP_M  (CORE0_AHB_PDMA_IN_CH2_INT_MAP_V << CORE0_AHB_PDMA_IN_CH2_INT_MAP_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP_S  0

/** INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xec)
/** INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_M  (CORE0_AHB_PDMA_OUT_CH0_INT_MAP_V << CORE0_AHB_PDMA_OUT_CH0_INT_MAP_S)
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_S  0

