espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xf0)
/** INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_M  (CORE0_AHB_PDMA_OUT_CH1_INT_MAP_V << CORE0_AHB_PDMA_OUT_CH1_INT_MAP_S)
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_S  0

/** INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xf4)
/** INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_M  (CORE0_AHB_PDMA_OUT_CH2_INT_MAP_V << CORE0_AHB_PDMA_OUT_CH2_INT_MAP_S)
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_S  0

/** INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xf8)
/** INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP_M  (CORE0_AXI_PDMA_IN_CH0_INT_MAP_V << CORE0_AXI_PDMA_IN_CH0_INT_MAP_S)
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP_S  0

/** INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xfc)
/** INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP_M  (CORE0_AXI_PDMA_IN_CH1_INT_MAP_V << CORE0_AXI_PDMA_IN_CH1_INT_MAP_S)
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP_S  0

/** INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x100)
/** INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP_M  (CORE0_AXI_PDMA_IN_CH2_INT_MAP_V << CORE0_AXI_PDMA_IN_CH2_INT_MAP_S)
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP_S  0

/** INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x104)
/** INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_M  (CORE0_AXI_PDMA_OUT_CH0_INT_MAP_V << CORE0_AXI_PDMA_OUT_CH0_INT_MAP_S)
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_S  0

/** INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x108)
/** INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_M  (CORE0_AXI_PDMA_OUT_CH1_INT_MAP_V << CORE0_AXI_PDMA_OUT_CH1_INT_MAP_S)
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_S  0

/** INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x10c)
/** INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_M  (CORE0_AXI_PDMA_OUT_CH2_INT_MAP_V << CORE0_AXI_PDMA_OUT_CH2_INT_MAP_S)
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_S  0

/** INTERRUPT_CORE0_RSA_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_RSA_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x110)
/** INTERRUPT_CORE0_RSA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_RSA_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_RSA_INT_MAP_M  (CORE0_RSA_INT_MAP_V << CORE0_RSA_INT_MAP_S)
#define INTERRUPT_CORE0_RSA_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_RSA_INT_MAP_S  0

/** INTERRUPT_CORE0_AES_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_AES_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x114)
/** INTERRUPT_CORE0_AES_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_AES_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_AES_INT_MAP_M  (CORE0_AES_INT_MAP_V << CORE0_AES_INT_MAP_S)
#define INTERRUPT_CORE0_AES_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AES_INT_MAP_S  0

/** INTERRUPT_CORE0_SHA_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_SHA_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x118)
/** INTERRUPT_CORE0_SHA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_SHA_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_SHA_INT_MAP_M  (CORE0_SHA_INT_MAP_V << CORE0_SHA_INT_MAP_S)
#define INTERRUPT_CORE0_SHA_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SHA_INT_MAP_S  0

/** INTERRUPT_CORE0_ECC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_ECC_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x11c)
/** INTERRUPT_CORE0_ECC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_ECC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_ECC_INT_MAP_M  (CORE0_ECC_INT_MAP_V << CORE0_ECC_INT_MAP_S)
#define INTERRUPT_CORE0_ECC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ECC_INT_MAP_S  0

/** INTERRUPT_CORE0_ECDSA_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_ECDSA_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x120)
/** INTERRUPT_CORE0_ECDSA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_ECDSA_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_ECDSA_INT_MAP_M  (CORE0_ECDSA_INT_MAP_V << CORE0_ECDSA_INT_MAP_S)
#define INTERRUPT_CORE0_ECDSA_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ECDSA_INT_MAP_S  0

/** INTERRUPT_CORE0_KM_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_KM_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x124)
/** INTERRUPT_CORE0_KM_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_KM_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_KM_INT_MAP_M  (CORE0_KM_INT_MAP_V << CORE0_KM_INT_MAP_S)
#define INTERRUPT_CORE0_KM_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_KM_INT_MAP_S  0

/** INTERRUPT_CORE0_GPIO_INT0_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_GPIO_INT0_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x128)
/** INTERRUPT_CORE0_GPIO_INT0_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_GPIO_INT0_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPIO_INT0_MAP_M  (CORE0_GPIO_INT0_MAP_V << CORE0_GPIO_INT0_MAP_S)
#define INTERRUPT_CORE0_GPIO_INT0_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPIO_INT0_MAP_S  0

/** INTERRUPT_CORE0_GPIO_INT1_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_GPIO_INT1_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x12c)
/** INTERRUPT_CORE0_GPIO_INT1_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_GPIO_INT1_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPIO_INT1_MAP_M  (CORE0_GPIO_INT1_MAP_V << CORE0_GPIO_INT1_MAP_S)
#define INTERRUPT_CORE0_GPIO_INT1_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPIO_INT1_MAP_S  0

