espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_GPIO_INT2_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_GPIO_INT2_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x130)
/** INTERRUPT_CORE0_GPIO_INT2_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_GPIO_INT2_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPIO_INT2_MAP_M  (CORE0_GPIO_INT2_MAP_V << CORE0_GPIO_INT2_MAP_S)
#define INTERRUPT_CORE0_GPIO_INT2_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPIO_INT2_MAP_S  0

/** INTERRUPT_CORE0_GPIO_INT3_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_GPIO_INT3_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x134)
/** INTERRUPT_CORE0_GPIO_INT3_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_GPIO_INT3_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPIO_INT3_MAP_M  (CORE0_GPIO_INT3_MAP_V << CORE0_GPIO_INT3_MAP_S)
#define INTERRUPT_CORE0_GPIO_INT3_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPIO_INT3_MAP_S  0

/** INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x138)
/** INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP_M  (CORE0_GPIO_PAD_COMP_INT_MAP_V << CORE0_GPIO_PAD_COMP_INT_MAP_S)
#define INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x13c)
/** INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP_M  (CORE0_CPU_INT_FROM_CPU_0_MAP_V << CORE0_CPU_INT_FROM_CPU_0_MAP_S)
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x140)
/** INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP_M  (CORE0_CPU_INT_FROM_CPU_1_MAP_V << CORE0_CPU_INT_FROM_CPU_1_MAP_S)
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x144)
/** INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP_M  (CORE0_CPU_INT_FROM_CPU_2_MAP_V << CORE0_CPU_INT_FROM_CPU_2_MAP_S)
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x148)
/** INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP_M  (CORE0_CPU_INT_FROM_CPU_3_MAP_V << CORE0_CPU_INT_FROM_CPU_3_MAP_S)
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP_S  0

/** INTERRUPT_CORE0_CACHE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CACHE_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x14c)
/** INTERRUPT_CORE0_CACHE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CACHE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_CACHE_INT_MAP_M  (CORE0_CACHE_INT_MAP_V << CORE0_CACHE_INT_MAP_S)
#define INTERRUPT_CORE0_CACHE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CACHE_INT_MAP_S  0

/** INTERRUPT_CORE0_FLASH_MSPI_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_FLASH_MSPI_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x150)
/** INTERRUPT_CORE0_FLASH_MSPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_FLASH_MSPI_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_FLASH_MSPI_INT_MAP_M  (CORE0_FLASH_MSPI_INT_MAP_V << CORE0_FLASH_MSPI_INT_MAP_S)
#define INTERRUPT_CORE0_FLASH_MSPI_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_FLASH_MSPI_INT_MAP_S  0

/** INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x154)
/** INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP_M  (CORE0_CSI_BRIDGE_INT_MAP_V << CORE0_CSI_BRIDGE_INT_MAP_S)
#define INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP_S  0

/** INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x158)
/** INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP_M  (CORE0_DSI_BRIDGE_INT_MAP_V << CORE0_DSI_BRIDGE_INT_MAP_S)
#define INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP_S  0

/** INTERRUPT_CORE0_CSI_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CSI_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x15c)
/** INTERRUPT_CORE0_CSI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CSI_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_CSI_INT_MAP_M  (CORE0_CSI_INT_MAP_V << CORE0_CSI_INT_MAP_S)
#define INTERRUPT_CORE0_CSI_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CSI_INT_MAP_S  0

/** INTERRUPT_CORE0_DSI_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_DSI_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x160)
/** INTERRUPT_CORE0_DSI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_DSI_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_DSI_INT_MAP_M  (CORE0_DSI_INT_MAP_V << CORE0_DSI_INT_MAP_S)
#define INTERRUPT_CORE0_DSI_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DSI_INT_MAP_S  0

/** INTERRUPT_CORE0_GMII_PHY_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_GMII_PHY_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x164)
/** INTERRUPT_CORE0_GMII_PHY_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_GMII_PHY_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_GMII_PHY_INT_MAP_M  (CORE0_GMII_PHY_INT_MAP_V << CORE0_GMII_PHY_INT_MAP_S)
#define INTERRUPT_CORE0_GMII_PHY_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GMII_PHY_INT_MAP_S  0

/** INTERRUPT_CORE0_LPI_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_LPI_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x168)
/** INTERRUPT_CORE0_LPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_LPI_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_LPI_INT_MAP_M  (CORE0_LPI_INT_MAP_V << CORE0_LPI_INT_MAP_S)
#define INTERRUPT_CORE0_LPI_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LPI_INT_MAP_S  0

/** INTERRUPT_CORE0_PMT_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_PMT_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x16c)
/** INTERRUPT_CORE0_PMT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_PMT_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_PMT_INT_MAP_M  (CORE0_PMT_INT_MAP_V << CORE0_PMT_INT_MAP_S)
#define INTERRUPT_CORE0_PMT_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PMT_INT_MAP_S  0

/** INTERRUPT_CORE0_SBD_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_SBD_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x170)
/** INTERRUPT_CORE0_SBD_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_SBD_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_SBD_INT_MAP_M  (CORE0_SBD_INT_MAP_V << CORE0_SBD_INT_MAP_S)
#define INTERRUPT_CORE0_SBD_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SBD_INT_MAP_S  0

/** INTERRUPT_CORE0_USB_OTG_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_USB_OTG_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x174)
/** INTERRUPT_CORE0_USB_OTG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_USB_OTG_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_USB_OTG_INT_MAP_M  (CORE0_USB_OTG_INT_MAP_V << CORE0_USB_OTG_INT_MAP_S)
#define INTERRUPT_CORE0_USB_OTG_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_USB_OTG_INT_MAP_S  0

/** INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x178)
/** INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_M  (CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_V << CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_S)
#define INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_S  0

/** INTERRUPT_CORE0_JPEG_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_JPEG_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x17c)
/** INTERRUPT_CORE0_JPEG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_JPEG_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_JPEG_INT_MAP_M  (CORE0_JPEG_INT_MAP_V << CORE0_JPEG_INT_MAP_S)
#define INTERRUPT_CORE0_JPEG_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_JPEG_INT_MAP_S  0

/** INTERRUPT_CORE0_PPA_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_PPA_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x180)
/** INTERRUPT_CORE0_PPA_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_PPA_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_PPA_INT_MAP_M  (CORE0_PPA_INT_MAP_V << CORE0_PPA_INT_MAP_S)
#define INTERRUPT_CORE0_PPA_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PPA_INT_MAP_S  0

/** INTERRUPT_CORE0_TRACE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_TRACE_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x184)
/** INTERRUPT_CORE0_CORE0_TRACE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CORE0_TRACE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_CORE0_TRACE_INT_MAP_M  (CORE0_CORE0_TRACE_INT_MAP_V << CORE0_CORE0_TRACE_INT_MAP_S)
#define INTERRUPT_CORE0_CORE0_TRACE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CORE0_TRACE_INT_MAP_S  0

/** INTERRUPT_CORE0_CORE1_TRACE_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CORE1_TRACE_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x188)
/** INTERRUPT_CORE0_CORE1_TRACE_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_CORE1_TRACE_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_CORE1_TRACE_INT_MAP_M  (CORE0_CORE1_TRACE_INT_MAP_V << CORE0_CORE1_TRACE_INT_MAP_S)
#define INTERRUPT_CORE0_CORE1_TRACE_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CORE1_TRACE_INT_MAP_S  0

