espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x18c)
/** INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP_M  (CORE0_HP_CORE_CTRL_INT_MAP_V << CORE0_HP_CORE_CTRL_INT_MAP_S)
#define INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP_S  0

/** INTERRUPT_CORE0_ISP_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_ISP_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x190)
/** INTERRUPT_CORE0_ISP_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_ISP_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_ISP_INT_MAP_M  (CORE0_ISP_INT_MAP_V << CORE0_ISP_INT_MAP_S)
#define INTERRUPT_CORE0_ISP_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ISP_INT_MAP_S  0

/** INTERRUPT_CORE0_I3C_MST_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_I3C_MST_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x194)
/** INTERRUPT_CORE0_I3C_MST_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_I3C_MST_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_I3C_MST_INT_MAP_M  (CORE0_I3C_MST_INT_MAP_V << CORE0_I3C_MST_INT_MAP_S)
#define INTERRUPT_CORE0_I3C_MST_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I3C_MST_INT_MAP_S  0

/** INTERRUPT_CORE0_I3C_SLV_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_I3C_SLV_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x198)
/** INTERRUPT_CORE0_I3C_SLV_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_I3C_SLV_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_I3C_SLV_INT_MAP_M  (CORE0_I3C_SLV_INT_MAP_V << CORE0_I3C_SLV_INT_MAP_S)
#define INTERRUPT_CORE0_I3C_SLV_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I3C_SLV_INT_MAP_S  0

/** INTERRUPT_CORE0_USB_OTG11_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_USB_OTG11_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x19c)
/** INTERRUPT_CORE0_USB_OTG11_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_USB_OTG11_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_USB_OTG11_INT_MAP_M  (CORE0_USB_OTG11_INT_MAP_V << CORE0_USB_OTG11_INT_MAP_S)
#define INTERRUPT_CORE0_USB_OTG11_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_USB_OTG11_INT_MAP_S  0

/** INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1a0)
/** INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP_M  (CORE0_DMA2D_IN_CH0_INT_MAP_V << CORE0_DMA2D_IN_CH0_INT_MAP_S)
#define INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP_S  0

/** INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1a4)
/** INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP_M  (CORE0_DMA2D_IN_CH1_INT_MAP_V << CORE0_DMA2D_IN_CH1_INT_MAP_S)
#define INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP_S  0

/** INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1a8)
/** INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP_M  (CORE0_DMA2D_OUT_CH0_INT_MAP_V << CORE0_DMA2D_OUT_CH0_INT_MAP_S)
#define INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP_S  0

/** INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1ac)
/** INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP_M  (CORE0_DMA2D_OUT_CH1_INT_MAP_V << CORE0_DMA2D_OUT_CH1_INT_MAP_S)
#define INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP_S  0

/** INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1b0)
/** INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP_M  (CORE0_DMA2D_OUT_CH2_INT_MAP_V << CORE0_DMA2D_OUT_CH2_INT_MAP_S)
#define INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP_S  0

/** INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1b4)
/** INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP_M  (CORE0_PSRAM_MSPI_INT_MAP_V << CORE0_PSRAM_MSPI_INT_MAP_S)
#define INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP_S  0

/** INTERRUPT_CORE0_HP_SYSREG_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_HP_SYSREG_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1b8)
/** INTERRUPT_CORE0_HP_SYSREG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_HP_SYSREG_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_SYSREG_INT_MAP_M  (CORE0_HP_SYSREG_INT_MAP_V << CORE0_HP_SYSREG_INT_MAP_S)
#define INTERRUPT_CORE0_HP_SYSREG_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_SYSREG_INT_MAP_S  0

/** INTERRUPT_CORE0_PCNT_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_PCNT_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1bc)
/** INTERRUPT_CORE0_PCNT_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_PCNT_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_PCNT_INT_MAP_M  (CORE0_PCNT_INT_MAP_V << CORE0_PCNT_INT_MAP_S)
#define INTERRUPT_CORE0_PCNT_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PCNT_INT_MAP_S  0

/** INTERRUPT_CORE0_HP_PAU_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_HP_PAU_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1c0)
/** INTERRUPT_CORE0_HP_PAU_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_HP_PAU_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_PAU_INT_MAP_M  (CORE0_HP_PAU_INT_MAP_V << CORE0_HP_PAU_INT_MAP_S)
#define INTERRUPT_CORE0_HP_PAU_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_PAU_INT_MAP_S  0

