espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1c4)
/** INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP_M  (CORE0_HP_PARLIO_RX_INT_MAP_V << CORE0_HP_PARLIO_RX_INT_MAP_S)
#define INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP_S  0

/** INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1c8)
/** INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP_M  (CORE0_HP_PARLIO_TX_INT_MAP_V << CORE0_HP_PARLIO_TX_INT_MAP_S)
#define INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP_S  0

/** INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1cc)
/** INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_M  (CORE0_H264_DMA2D_OUT_CH0_INT_MAP_V << CORE0_H264_DMA2D_OUT_CH0_INT_MAP_S)
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_S  0

/** INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1d0)
/** INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_M  (CORE0_H264_DMA2D_OUT_CH1_INT_MAP_V << CORE0_H264_DMA2D_OUT_CH1_INT_MAP_S)
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_S  0

/** INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1d4)
/** INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_M  (CORE0_H264_DMA2D_OUT_CH2_INT_MAP_V << CORE0_H264_DMA2D_OUT_CH2_INT_MAP_S)
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_S  0

/** INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1d8)
/** INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_M  (CORE0_H264_DMA2D_OUT_CH3_INT_MAP_V << CORE0_H264_DMA2D_OUT_CH3_INT_MAP_S)
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_S  0

/** INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1dc)
/** INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_M  (CORE0_H264_DMA2D_OUT_CH4_INT_MAP_V << CORE0_H264_DMA2D_OUT_CH4_INT_MAP_S)
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_S  0

/** INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1e0)
/** INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP_M  (CORE0_H264_DMA2D_IN_CH0_INT_MAP_V << CORE0_H264_DMA2D_IN_CH0_INT_MAP_S)
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP_S  0

/** INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1e4)
/** INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP_M  (CORE0_H264_DMA2D_IN_CH1_INT_MAP_V << CORE0_H264_DMA2D_IN_CH1_INT_MAP_S)
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP_S  0

/** INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1e8)
/** INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP_M  (CORE0_H264_DMA2D_IN_CH2_INT_MAP_V << CORE0_H264_DMA2D_IN_CH2_INT_MAP_S)
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP_S  0

/** INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1ec)
/** INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP_M  (CORE0_H264_DMA2D_IN_CH3_INT_MAP_V << CORE0_H264_DMA2D_IN_CH3_INT_MAP_S)
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP_S  0

