espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1f0)
/** INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP_M  (CORE0_H264_DMA2D_IN_CH4_INT_MAP_V << CORE0_H264_DMA2D_IN_CH4_INT_MAP_S)
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP_S  0

/** INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1f4)
/** INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP_M  (CORE0_H264_DMA2D_IN_CH5_INT_MAP_V << CORE0_H264_DMA2D_IN_CH5_INT_MAP_S)
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP_S  0

/** INTERRUPT_CORE0_H264_REG_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_H264_REG_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1f8)
/** INTERRUPT_CORE0_H264_REG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_H264_REG_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_H264_REG_INT_MAP_M  (CORE0_H264_REG_INT_MAP_V << CORE0_H264_REG_INT_MAP_S)
#define INTERRUPT_CORE0_H264_REG_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_H264_REG_INT_MAP_S  0

/** INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP_REG register
 *  NA
 */
#define INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1fc)
/** INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP : R/W; bitpos: [5:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP    0x0000003FU
#define INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP_M  (CORE0_ASSIST_DEBUG_INT_MAP_V << CORE0_ASSIST_DEBUG_INT_MAP_S)
#define INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP_S  0

/** INTERRUPT_CORE0_INTR_STATUS_REG_0_REG register
 *  NA
 */
#define INTERRUPT_CORE0_INTR_STATUS_REG_0_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x200)
/** INTERRUPT_CORE0_INTR_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_INTR_STATUS_0    0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_0_M  (CORE0_INTR_STATUS_0_V << CORE0_INTR_STATUS_0_S)
#define INTERRUPT_CORE0_INTR_STATUS_0_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_0_S  0

/** INTERRUPT_CORE0_INTR_STATUS_REG_1_REG register
 *  NA
 */
#define INTERRUPT_CORE0_INTR_STATUS_REG_1_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x204)
/** INTERRUPT_CORE0_INTR_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_INTR_STATUS_1    0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_1_M  (CORE0_INTR_STATUS_1_V << CORE0_INTR_STATUS_1_S)
#define INTERRUPT_CORE0_INTR_STATUS_1_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_1_S  0

/** INTERRUPT_CORE0_INTR_STATUS_REG_2_REG register
 *  NA
 */
#define INTERRUPT_CORE0_INTR_STATUS_REG_2_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x208)
/** INTERRUPT_CORE0_INTR_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_INTR_STATUS_2    0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_2_M  (CORE0_INTR_STATUS_2_V << CORE0_INTR_STATUS_2_S)
#define INTERRUPT_CORE0_INTR_STATUS_2_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_2_S  0

/** INTERRUPT_CORE0_INTR_STATUS_REG_3_REG register
 *  NA
 */
#define INTERRUPT_CORE0_INTR_STATUS_REG_3_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x20c)
/** INTERRUPT_CORE0_INTR_STATUS_3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define INTERRUPT_CORE0_INTR_STATUS_3    0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_3_M  (CORE0_INTR_STATUS_3_V << CORE0_INTR_STATUS_3_S)
#define INTERRUPT_CORE0_INTR_STATUS_3_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_3_S  0

/** INTERRUPT_CORE0_CLOCK_GATE_REG register
 *  NA
 */
#define INTERRUPT_CORE0_CLOCK_GATE_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x210)
/** INTERRUPT_CORE0_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define INTERRUPT_CORE0_REG_CLK_EN    (BIT(0))
#define INTERRUPT_CORE0_REG_CLK_EN_M  (CORE0_REG_CLK_EN_V << CORE0_REG_CLK_EN_S)
#define INTERRUPT_CORE0_REG_CLK_EN_V  0x00000001U
#define INTERRUPT_CORE0_REG_CLK_EN_S  0

/** INTERRUPT_CORE0_INTERRUPT_REG_DATE_REG register
 *  NA
 */
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x3fc)
/** INTERRUPT_CORE0_INTERRUPT_REG_DATE : R/W; bitpos: [27:0]; default: 33566752;
 *  NA
 */
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE    0x0FFFFFFFU
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_M  (CORE0_INTERRUPT_REG_DATE_V << CORE0_INTERRUPT_REG_DATE_S)
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_V  0x0FFFFFFFU
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_S  0

#ifdef __cplusplus
}
#endif
